# ClearFaceWithElementHandleMap Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFC..::..ClearFaceWithElementHandleMap Method
ExporterIFC Class See Also
---
Clear face with element handle map.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void ClearFaceWithElementHandleMap()
```

Visual Basic
---
```text
Public Sub ClearFaceWithElementHandleMap
```

Visual C++
---
```text
public:
void ClearFaceWithElementHandleMap()
```

# See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace